Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyCannotBeUpgraded Property
 "Family '[Name]' cannot be upgraded and must be deleted. To fix the file in the older version of Revit, try loading newer versions of these families: [Names]."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyCannotBeUpgraded { get; }
Public Shared ReadOnly Property FamilyCannotBeUpgraded As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyCannotBeUpgraded {
	FailureDefinitionId^ get ();
}
static member FamilyCannotBeUpgraded : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace